## Production: cognito
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                    |
|--------|---------------------------------------------------------------------------|
| update | `aws_cognito_user_pool.forms`                                             |
| add    | `aws_lambda_function.cognito_email_sender`                                |
|        | `aws_lambda_function.cognito_pre_sign_up`                                 |
|        | `aws_lambda_permission.allow_cognito_to_call_cognito_email_sender_lambda` |
|        | `aws_lambda_permission.allow_cognito_to_call_cognito_pre_sign_up_lambda`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cognito_user_pool.forms will be updated in-place
  ~ resource "aws_cognito_user_pool" "forms" {
        id                        = "ca-central-1_eSTGTCw33"
        name                      = "forms_user_pool"
        tags                      = {}
        # (11 unchanged attributes hidden)

      ~ lambda_config {
          ~ pre_sign_up = "arn:aws:lambda:ca-central-1:957818836222:function:Cognito_Pre_Sign_Up" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ custom_email_sender {
              ~ lambda_arn     = "arn:aws:lambda:ca-central-1:957818836222:function:Cognito_Email_Sender" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.cognito_email_sender will be created
  + resource "aws_lambda_function" "cognito_email_sender" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito-email-sender"
      + id                             = (known after apply)
      + image_uri                      = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/cognito-email-sender-lambda:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::957818836222:role/iam_for_cognito_lambda"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "KEY_ALIAS"      = "arn:aws:kms:ca-central-1:957818836222:alias/cognito-encryption-key"
              + "KEY_ARN"        = "arn:aws:kms:ca-central-1:957818836222:key/632f1017-9281-41b3-8f25-56c6f81843a6"
              + "NOTIFY_API_KEY" = (sensitive value)
              + "TEMPLATE_ID"    = "8dde39b6-05b9-43ce-807f-c2364ed3bdb6"
            }
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = "/aws/lambda/Cognito_Email_Sender"
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.cognito_pre_sign_up will be created
  + resource "aws_lambda_function" "cognito_pre_sign_up" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito-pre-sign-up"
      + id                             = (known after apply)
      + image_uri                      = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/cognito-pre-sign-up-lambda:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::957818836222:role/iam_for_cognito_lambda"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + logging_config {
          + log_format = "Text"
          + log_group  = "/aws/lambda/Cognito_Pre_Sign_Up"
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_permission.allow_cognito_to_call_cognito_email_sender_lambda will be created
  + resource "aws_lambda_permission" "allow_cognito_to_call_cognito_email_sender_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cognito-email-sender"
      + id                  = (known after apply)
      + principal           = "cognito-idp.amazonaws.com"
      + source_arn          = "arn:aws:cognito-idp:ca-central-1:957818836222:userpool/ca-central-1_eSTGTCw33"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.allow_cognito_to_call_cognito_pre_sign_up_lambda will be created
  + resource "aws_lambda_permission" "allow_cognito_to_call_cognito_pre_sign_up_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cognito-pre-sign-up"
      + id                  = (known after apply)
      + principal           = "cognito-idp.amazonaws.com"
      + source_arn          = "arn:aws:cognito-idp:ca-central-1:957818836222:userpool/ca-central-1_eSTGTCw33"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cognito_email_sender"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cognito_pre_sign_up"]
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_userpool_import_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.cognito_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.cognito_userpool_import"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cognito_encryption"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.cognito_email_sender"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.cognito_pre_sign_up"]

31 tests, 19 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
